# Taps
tap "homebrew/bundle"

# Binaries
brew "btop"
brew "fd"
brew "fzf"
brew "gh"
brew "git"
brew "jq"
brew "lsd"
brew "mas"
brew "redis"
brew "ripgrep"
brew "ruby-build" # Required for Mise to install Ruby
brew "telnet"
brew "tlrc"
brew "watchman"
brew "zsh"
brew "zoxide"

# Fonts
cask "font-cascadia-mono"
cask "font-cascadia-mono-nf"
cask "font-commit-mono"
cask "font-fira-code"
cask "font-jetbrains-mono"
cask "font-meslo-lg-nerd-font"
cask "font-sf-mono"

# Apps
cask "1password"
cask "1password-cli"
cask "android-studio"
cask "appcleaner"
cask "arc"
cask "devcleaner"
cask "discord"
cask "docker"
cask "figma"
cask "grandperspective"
cask "handbrake"
cask "iina"
cask "imageoptim"
cask "iterm2"
cask "latest"
cask "linear-linear"
cask "logi-options-plus"
# cask "logitune"
# cask "loom"
# cask "maccy"
cask "monitorcontrol"
cask "mullvadvpn"
cask "notion"
cask "postman"
cask "proxyman"
cask "raycast"
cask "rectangle"
cask "sf-symbols"
cask "slack"
cask "stats"
cask "tableplus"
cask "visual-studio-code"
cask "whatsapp"
cask "xcodes"
cask "zoom"

# App Store
mas "DaisyDisk", id: 411643860
mas "Dato", id: 1470584107
mas "Developer", id: 640199958
mas "Craft", id: 1487937127
mas "Microsoft Excel", id: 462058435
mas "MoneyWiz", id: 1511185140
mas "PDF Viewer", id: 1120099014
mas "Playgrounds", id: 1496833156
mas "TestFlight", id: 899247664
