# Taps
tap "homebrew/bundle"

# Binaries
brew "aviator-co/tap/av"
brew "btop"
brew "fd"
brew "fzf"
brew "gh"
brew "git"
brew "jq"
brew "lsd"
brew "mas"
brew "ripgrep"
brew "ruby-build" # Required for Mise to install Ruby
brew "starship"
brew "telnet"
brew "tlrc"
brew "watchman"
brew "zoxide"
brew "zsh"

# Fonts
cask "font-cascadia-mono"
cask "font-cascadia-mono-nf"
cask "font-commit-mono"
cask "font-fira-code"
cask "font-jetbrains-mono"
cask "font-meslo-lg-nerd-font"
cask "font-sf-mono"

# Apps
cask "1password"
cask "1password-cli"
cask "android-studio"
cask "appcleaner"
cask "bruno"
cask "chatgpt"
cask "cloudflare-warp"
cask "devcleaner"
cask "discord"
cask "docker"
cask "expo-orbit"
cask "fantastical"
cask "figma"
cask "grandperspective"
cask "ghostty"
cask "handbrake"
cask "iina"
cask "imageoptim"
cask "jordanbaird-ice"
cask "latest"
cask "linear-linear"
cask "logi-options+"
cask "loom"
cask "monitorcontrol"
cask "mullvadvpn"
cask "music-decoy"
cask "notion"
cask "obsidian"
cask "proxyman"
cask "raycast"
cask "sf-symbols"
cask "shottr"
cask "slack"
cask "stats"
cask "tableplus"
cask "visual-studio-code"
cask "whatsapp"
cask "xcodes"
cask "zoom"

# App Store
mas "DaisyDisk", id: 411643860
mas "Developer", id: 640199958
mas "Just Press Record", id: 1033342465
mas "Kindle", id: 302584613
mas "Microsoft Excel", id: 462058435
mas "MoneyWiz", id: 1511185140
mas "PDF Viewer", id: 1120099014
mas "Playgrounds", id: 1496833156
mas "TestFlight", id: 899247664

# Safari Extensions
mas "1Password for Safari", id: 1569813296
mas "Noir", id: 1592917505
mas "Save to Raindrop.io", id: 1549370672
mas "Save to Reader", id: 1640236961
mas "Wipr", id: 1662217862
