# Binaries
brew "aviator-co/tap/av"
brew "bat"
brew "btop"
brew "fastfetch"
brew "fd"
brew "fzf"
brew "gh"
brew "git"
brew "git-delta"
brew "jq"
brew "lazygit"
brew "lsd"
brew "mas"
brew "mise"
brew "mole"
brew "ripgrep"
brew "starship"
brew "tlrc"
brew "yazi"
brew "zoxide"
brew "zsh"

# Fonts
cask "font-jetbrains-mono"
cask "font-jetbrains-mono-nerd-font"
cask "font-sf-mono"

# Apps
cask "1password"
cask "1password-cli"
cask "betterdisplay"
cask "bettermouse"
cask "brave-browser"
cask "bruno"
cask "busycal"
cask "chatgpt"
cask "codex"
cask "codex-app"
cask "discord"
cask "expo-orbit"
cask "ghostty"
cask "handbrake"
cask "iina"
cask "karabiner-elements"
cask "latest"
cask "music-decoy"
cask "netspot"
cask "obsidian"
cask "orbstack"
cask "raycast"
cask "sf-symbols"
cask "shottr"
cask "slack"
cask "spokenly"
cask "spotify"
cask "stats"
cask "tablepro"
cask "thaw"
cask "visual-studio-code"
cask "whatsapp"
cask "xcodes"
cask "zed"

# App Store
mas "DaisyDisk", id: 411643860
mas "Folder Quick Look", id: 6753110395
mas "Kindle", id: 302584613
mas "MoneyWiz", id: 1511185140
mas "Little Snitch Mini", id: 1629008763

# Safari Extensions
mas "1Password for Safari", id: 1569813296
mas "Wipr", id: 1662217862
